Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_rolo_1shunt_sam_c21/firmware/src/packs/ATSAMC21J18A_DFP/component/can.h
/**
 * \brief Component description for CAN
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-04-08T12:38:18Z */
#ifndef _SAMC21_CAN_COMPONENT_H_
#define _SAMC21_CAN_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR CAN                                          */
/* ************************************************************************** */

/* -------- CAN_RXBE_0 : (CAN Offset: 0x00) (R/W 32) Rx Buffer Element 0 -------- */
#define CAN_RXBE_0_ID_Pos                     _U_(0)                                               /**< (CAN_RXBE_0) Identifier Position */
#define CAN_RXBE_0_ID_Msk                     (_U_(0x1FFFFFFF) << CAN_RXBE_0_ID_Pos)               /**< (CAN_RXBE_0) Identifier Mask */
#define CAN_RXBE_0_ID(value)                  (CAN_RXBE_0_ID_Msk & ((value) << CAN_RXBE_0_ID_Pos))
#define CAN_RXBE_0_RTR_Pos                    _U_(29)                                              /**< (CAN_RXBE_0) Remote Transmission Request Position */
#define CAN_RXBE_0_RTR_Msk                    (_U_(0x1) << CAN_RXBE_0_RTR_Pos)                     /**< (CAN_RXBE_0) Remote Transmission Request Mask */
#define CAN_RXBE_0_RTR(value)                 (CAN_RXBE_0_RTR_Msk & ((value) << CAN_RXBE_0_RTR_Pos))
#define CAN_RXBE_0_XTD_Pos                    _U_(30)                                              /**< (CAN_RXBE_0) Extended Identifier Position */
#define CAN_RXBE_0_XTD_Msk                    (_U_(0x1) << CAN_RXBE_0_XTD_Pos)                     /**< (CAN_RXBE_0) Extended Identifier Mask */
#define CAN_RXBE_0_XTD(value)                 (CAN_RXBE_0_XTD_Msk & ((value) << CAN_RXBE_0_XTD_Pos))
#define CAN_RXBE_0_ESI_Pos                    _U_(31)                                              /**< (CAN_RXBE_0) Error State Indicator Position */
#define CAN_RXBE_0_ESI_Msk                    (_U_(0x1) << CAN_RXBE_0_ESI_Pos)                     /**< (CAN_RXBE_0) Error State Indicator Mask */
#define CAN_RXBE_0_ESI(value)                 (CAN_RXBE_0_ESI_Msk & ((value) << CAN_RXBE_0_ESI_Pos))
#define CAN_RXBE_0_Msk                        _U_(0xFFFFFFFF)                                      /**< (CAN_RXBE_0) Register Mask  */


/* -------- CAN_RXBE_1 : (CAN Offset: 0x04) (R/W 32) Rx Buffer Element 1 -------- */
#define CAN_RXBE_1_RXTS_Pos                   _U_(0)                                               /**< (CAN_RXBE_1) Rx Timestamp Position */
#define CAN_RXBE_1_RXTS_Msk                   (_U_(0xFFFF) << CAN_RXBE_1_RXTS_Pos)                 /**< (CAN_RXBE_1) Rx Timestamp Mask */
#define CAN_RXBE_1_RXTS(value)                (CAN_RXBE_1_RXTS_Msk & ((value) << CAN_RXBE_1_RXTS_Pos))
#define CAN_RXBE_1_DLC_Pos                    _U_(16)                                              /**< (CAN_RXBE_1) Data Length Code Position */
#define CAN_RXBE_1_DLC_Msk                    (_U_(0xF) << CAN_RXBE_1_DLC_Pos)                     /**< (CAN_RXBE_1) Data Length Code Mask */
#define CAN_RXBE_1_DLC(value)                 (CAN_RXBE_1_DLC_Msk & ((value) << CAN_RXBE_1_DLC_Pos))
#define CAN_RXBE_1_BRS_Pos                    _U_(20)                                              /**< (CAN_RXBE_1) Bit Rate Switch Position */
#define CAN_RXBE_1_BRS_Msk                    (_U_(0x1) << CAN_RXBE_1_BRS_Pos)                     /**< (CAN_RXBE_1) Bit Rate Switch Mask */
#define CAN_RXBE_1_BRS(value)                 (CAN_RXBE_1_BRS_Msk & ((value) << CAN_RXBE_1_BRS_Pos))
#define CAN_RXBE_1_FDF_Pos                    _U_(21)                                              /**< (CAN_RXBE_1) FD Format Position */
#define CAN_RXBE_1_FDF_Msk                    (_U_(0x1) << CAN_RXBE_1_FDF_Pos)                     /**< (CAN_RXBE_1) FD Format Mask */
#define CAN_RXBE_1_FDF(value)                 (CAN_RXBE_1_FDF_Msk & ((value) << CAN_RXBE_1_FDF_Pos))
#define CAN_RXBE_1_FIDX_Pos                   _U_(24)                                              /**< (CAN_RXBE_1) Filter Index Position */
#define CAN_RXBE_1_FIDX_Msk                   (_U_(0x7F) << CAN_RXBE_1_FIDX_Pos)                   /**< (CAN_RXBE_1) Filter Index Mask */
#define CAN_RXBE_1_FIDX(value)                (CAN_RXBE_1_FIDX_Msk & ((value) << CAN_RXBE_1_FIDX_Pos))
#define CAN_RXBE_1_ANMF_Pos                   _U_(31)                                              /**< (CAN_RXBE_1) Accepted Non-matching Frame Position */
#define CAN_RXBE_1_ANMF_Msk                   (_U_(0x1) << CAN_RXBE_1_ANMF_Pos)                    /**< (CAN_RXBE_1) Accepted Non-matching Frame Mask */
#define CAN_RXBE_1_ANMF(value)                (CAN_RXBE_1_ANMF_Msk & ((value) << CAN_RXBE_1_ANMF_Pos))
#define CAN_RXBE_1_Msk                        _U_(0xFF3FFFFF)                                      /**< (CAN_RXBE_1) Register Mask  */


/* -------- CAN_RXBE_DATA : (CAN Offset: 0x08) (R/W 32) Rx Buffer Element Data -------- */
#define CAN_RXBE_DATA_DB0_Pos                 _U_(0)                                               /**< (CAN_RXBE_DATA) Data Byte 0 Position */
#define CAN_RXBE_DATA_DB0_Msk                 (_U_(0xFF) << CAN_RXBE_DATA_DB0_Pos)                 /**< (CAN_RXBE_DATA) Data Byte 0 Mask */
#define CAN_RXBE_DATA_DB0(value)              (CAN_RXBE_DATA_DB0_Msk & ((value) << CAN_RXBE_DATA_DB0_Pos))
#define CAN_RXBE_DATA_DB1_Pos                 _U_(8)                                               /**< (CAN_RXBE_DATA) Data Byte 1 Position */
#define CAN_RXBE_DATA_DB1_Msk                 (_U_(0xFF) << CAN_RXBE_DATA_DB1_Pos)                 /**< (CAN_RXBE_DATA) Data Byte 1 Mask */
#define CAN_RXBE_DATA_DB1(value)              (CAN_RXBE_DATA_DB1_Msk & ((value) << CAN_RXBE_DATA_DB1_Pos))
#define CAN_RXBE_DATA_DB2_Pos                 _U_(16)                                              /**< (CAN_RXBE_DATA) Data Byte 2 Position */
#define CAN_RXBE_DATA_DB2_Msk                 (_U_(0xFF) << CAN_RXBE_DATA_DB2_Pos)                 /**< (CAN_RXBE_DATA) Data Byte 2 Mask */
#define CAN_RXBE_DATA_DB2(value)              (CAN_RXBE_DATA_DB2_Msk & ((value) << CAN_RXBE_DATA_DB2_Pos))
#define CAN_RXBE_DATA_DB3_Pos                 _U_(24)                                              /**< (CAN_RXBE_DATA) Data Byte 3 Position */
#define CAN_RXBE_DATA_DB3_Msk                 (_U_(0xFF) << CAN_RXBE_DATA_DB3_Pos)                 /**< (CAN_RXBE_DATA) Data Byte 3 Mask */
#define CAN_RXBE_DATA_DB3(value)              (CAN_RXBE_DATA_DB3_Msk & ((value) << CAN_RXBE_DATA_DB3_Pos))
#define CAN_RXBE_DATA_Msk                     _U_(0xFFFFFFFF)                                      /**< (CAN_RXBE_DATA) Register Mask  */


/* -------- CAN_RXF0E_0 : (CAN Offset: 0x00) (R/W 32) Rx FIFO 0 Element 0 -------- */
#define CAN_RXF0E_0_ID_Pos                    _U_(0)                                               /**< (CAN_RXF0E_0) Identifier Position */
#define CAN_RXF0E_0_ID_Msk                    (_U_(0x1FFFFFFF) << CAN_RXF0E_0_ID_Pos)              /**< (CAN_RXF0E_0) Identifier Mask */
#define CAN_RXF0E_0_ID(value)                 (CAN_RXF0E_0_ID_Msk & ((value) << CAN_RXF0E_0_ID_Pos))
#define CAN_RXF0E_0_RTR_Pos                   _U_(29)                                              /**< (CAN_RXF0E_0) Remote Transmission Request Position */
#define CAN_RXF0E_0_RTR_Msk                   (_U_(0x1) << CAN_RXF0E_0_RTR_Pos)                    /**< (CAN_RXF0E_0) Remote Transmission Request Mask */
#define CAN_RXF0E_0_RTR(value)                (CAN_RXF0E_0_RTR_Msk & ((value) << CAN_RXF0E_0_RTR_Pos))
#define CAN_RXF0E_0_XTD_Pos                   _U_(30)                                              /**< (CAN_RXF0E_0) Extended Identifier Position */
#define CAN_RXF0E_0_XTD_Msk                   (_U_(0x1) << CAN_RXF0E_0_XTD_Pos)                    /**< (CAN_RXF0E_0) Extended Identifier Mask */
#define CAN_RXF0E_0_XTD(value)                (CAN_RXF0E_0_XTD_Msk & ((value) << CAN_RXF0E_0_XTD_Pos))
#define CAN_RXF0E_0_ESI_Pos                   _U_(31)                                              /**< (CAN_RXF0E_0) Error State Indicator Position */
#define CAN_RXF0E_0_ESI_Msk                   (_U_(0x1) << CAN_RXF0E_0_ESI_Pos)                    /**< (CAN_RXF0E_0) Error State Indicator Mask */
#define CAN_RXF0E_0_ESI(value)                (CAN_RXF0E_0_ESI_Msk & ((value) << CAN_RXF0E_0_ESI_Pos))
#define CAN_RXF0E_0_Msk                       _U_(0xFFFFFFFF)                                      /**< (CAN_RXF0E_0) Register Mask  */


/* -------- CAN_RXF0E_1 : (CAN Offset: 0x04) (R/W 32) Rx FIFO 0 Element 1 -------- */
#define CAN_RXF0E_1_RXTS_Pos                  _U_(0)                                               /**< (CAN_RXF0E_1) Rx Timestamp Position */
#define CAN_RXF0E_1_RXTS_Msk                  (_U_(0xFFFF) << CAN_RXF0E_1_RXTS_Pos)                /**< (CAN_RXF0E_1) Rx Timestamp Mask */
#define CAN_RXF0E_1_RXTS(value)               (CAN_RXF0E_1_RXTS_Msk & ((value) << CAN_RXF0E_1_RXTS_Pos))
#define CAN_RXF0E_1_DLC_Pos                   _U_(16)                                              /**< (CAN_RXF0E_1) Data Length Code Position */
#define CAN_RXF0E_1_DLC_Msk                   (_U_(0xF) << CAN_RXF0E_1_DLC_Pos)                    /**< (CAN_RXF0E_1) Data Length Code Mask */
#define CAN_RXF0E_1_DLC(value)                (CAN_RXF0E_1_DLC_Msk & ((value) << CAN_RXF0E_1_DLC_Pos))
#define CAN_RXF0E_1_BRS_Pos                   _U_(20)                                              /**< (CAN_RXF0E_1) Bit Rate Switch Position */
#define CAN_RXF0E_1_BRS_Msk                   (_U_(0x1) << CAN_RXF0E_1_BRS_Pos)                    /**< (CAN_RXF0E_1) Bit Rate Switch Mask */
#define CAN_RXF0E_1_BRS(value)                (CAN_RXF0E_1_BRS_Msk & ((value) << CAN_RXF0E_1_BRS_Pos))
#define CAN_RXF0E_1_FDF_Pos                   _U_(21)                                              /**< (CAN_RXF0E_1) FD Format Position */
#define CAN_RXF0E_1_FDF_Msk                   (_U_(0x1) << CAN_RXF0E_1_FDF_Pos)                    /**< (CAN_RXF0E_1) FD Format Mask */
#define CAN_RXF0E_1_FDF(value)                (CAN_RXF0E_1_FDF_Msk & ((value) << CAN_RXF0E_1_FDF_Pos))
#define CAN_RXF0E_1_FIDX_Pos                  _U_(24)                                              /**< (CAN_RXF0E_1) Filter Index Position */
#define CAN_RXF0E_1_FIDX_Msk                  (_U_(0x7F) << CAN_RXF0E_1_FIDX_Pos)                  /**< (CAN_RXF0E_1) Filter Index Mask */
#define CAN_RXF0E_1_FIDX(value)               (CAN_RXF0E_1_FIDX_Msk & ((value) << CAN_RXF0E_1_FIDX_Pos))
#define CAN_RXF0E_1_ANMF_Pos                  _U_(31)                                              /**< (CAN_RXF0E_1) Accepted Non-matching Frame Position */
#define CAN_RXF0E_1_ANMF_Msk                  (_U_(0x1) << CAN_RXF0E_1_ANMF_Pos)                   /**< (CAN_RXF0E_1) Accepted Non-matching Frame Mask */
#define CAN_RXF0E_1_ANMF(value)               (CAN_RXF0E_1_ANMF_Msk & ((value) << CAN_RXF0E_1_ANMF_Pos))
#define CAN_RXF0E_1_Msk                       _U_(0xFF3FFFFF)                                      /**< (CAN_RXF0E_1) Register Mask  */


