Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_rolo_1shunt_sam_c21/firmware/src/packs/ATSAMC21J18A_DFP/component/can.h
#define CAN_TDCR_TDCF_Pos                     _U_(0)                                               /**< (CAN_TDCR) Transmitter Delay Compensation Filter Length Position */
#define CAN_TDCR_TDCF_Msk                     (_U_(0x7F) << CAN_TDCR_TDCF_Pos)                     /**< (CAN_TDCR) Transmitter Delay Compensation Filter Length Mask */
#define CAN_TDCR_TDCF(value)                  (CAN_TDCR_TDCF_Msk & ((value) << CAN_TDCR_TDCF_Pos))
#define CAN_TDCR_TDCO_Pos                     _U_(8)                                               /**< (CAN_TDCR) Transmitter Delay Compensation Offset Position */
#define CAN_TDCR_TDCO_Msk                     (_U_(0x7F) << CAN_TDCR_TDCO_Pos)                     /**< (CAN_TDCR) Transmitter Delay Compensation Offset Mask */
#define CAN_TDCR_TDCO(value)                  (CAN_TDCR_TDCO_Msk & ((value) << CAN_TDCR_TDCO_Pos))
#define CAN_TDCR_Msk                          _U_(0x00007F7F)                                      /**< (CAN_TDCR) Register Mask  */


/* -------- CAN_IR : (CAN Offset: 0x50) (R/W 32) Interrupt -------- */
#define CAN_IR_RESETVALUE                     _U_(0x00)                                            /**<  (CAN_IR) Interrupt  Reset Value */

#define CAN_IR_RF0N_Pos                       _U_(0)                                               /**< (CAN_IR) Rx FIFO 0 New Message Position */
#define CAN_IR_RF0N_Msk                       (_U_(0x1) << CAN_IR_RF0N_Pos)                        /**< (CAN_IR) Rx FIFO 0 New Message Mask */
#define CAN_IR_RF0N(value)                    (CAN_IR_RF0N_Msk & ((value) << CAN_IR_RF0N_Pos))    
#define CAN_IR_RF0W_Pos                       _U_(1)                                               /**< (CAN_IR) Rx FIFO 0 Watermark Reached Position */
#define CAN_IR_RF0W_Msk                       (_U_(0x1) << CAN_IR_RF0W_Pos)                        /**< (CAN_IR) Rx FIFO 0 Watermark Reached Mask */
#define CAN_IR_RF0W(value)                    (CAN_IR_RF0W_Msk & ((value) << CAN_IR_RF0W_Pos))    
#define CAN_IR_RF0F_Pos                       _U_(2)                                               /**< (CAN_IR) Rx FIFO 0 Full Position */
#define CAN_IR_RF0F_Msk                       (_U_(0x1) << CAN_IR_RF0F_Pos)                        /**< (CAN_IR) Rx FIFO 0 Full Mask */
#define CAN_IR_RF0F(value)                    (CAN_IR_RF0F_Msk & ((value) << CAN_IR_RF0F_Pos))    
#define CAN_IR_RF0L_Pos                       _U_(3)                                               /**< (CAN_IR) Rx FIFO 0 Message Lost Position */
#define CAN_IR_RF0L_Msk                       (_U_(0x1) << CAN_IR_RF0L_Pos)                        /**< (CAN_IR) Rx FIFO 0 Message Lost Mask */
#define CAN_IR_RF0L(value)                    (CAN_IR_RF0L_Msk & ((value) << CAN_IR_RF0L_Pos))    
#define CAN_IR_RF1N_Pos                       _U_(4)                                               /**< (CAN_IR) Rx FIFO 1 New Message Position */
#define CAN_IR_RF1N_Msk                       (_U_(0x1) << CAN_IR_RF1N_Pos)                        /**< (CAN_IR) Rx FIFO 1 New Message Mask */
#define CAN_IR_RF1N(value)                    (CAN_IR_RF1N_Msk & ((value) << CAN_IR_RF1N_Pos))    
#define CAN_IR_RF1W_Pos                       _U_(5)                                               /**< (CAN_IR) Rx FIFO 1 Watermark Reached Position */
#define CAN_IR_RF1W_Msk                       (_U_(0x1) << CAN_IR_RF1W_Pos)                        /**< (CAN_IR) Rx FIFO 1 Watermark Reached Mask */
#define CAN_IR_RF1W(value)                    (CAN_IR_RF1W_Msk & ((value) << CAN_IR_RF1W_Pos))    
#define CAN_IR_RF1F_Pos                       _U_(6)                                               /**< (CAN_IR) Rx FIFO 1 FIFO Full Position */
#define CAN_IR_RF1F_Msk                       (_U_(0x1) << CAN_IR_RF1F_Pos)                        /**< (CAN_IR) Rx FIFO 1 FIFO Full Mask */
#define CAN_IR_RF1F(value)                    (CAN_IR_RF1F_Msk & ((value) << CAN_IR_RF1F_Pos))    
#define CAN_IR_RF1L_Pos                       _U_(7)                                               /**< (CAN_IR) Rx FIFO 1 Message Lost Position */
#define CAN_IR_RF1L_Msk                       (_U_(0x1) << CAN_IR_RF1L_Pos)                        /**< (CAN_IR) Rx FIFO 1 Message Lost Mask */
#define CAN_IR_RF1L(value)                    (CAN_IR_RF1L_Msk & ((value) << CAN_IR_RF1L_Pos))    
#define CAN_IR_HPM_Pos                        _U_(8)                                               /**< (CAN_IR) High Priority Message Position */
#define CAN_IR_HPM_Msk                        (_U_(0x1) << CAN_IR_HPM_Pos)                         /**< (CAN_IR) High Priority Message Mask */
#define CAN_IR_HPM(value)                     (CAN_IR_HPM_Msk & ((value) << CAN_IR_HPM_Pos))      
#define CAN_IR_TC_Pos                         _U_(9)                                               /**< (CAN_IR) Timestamp Completed Position */
#define CAN_IR_TC_Msk                         (_U_(0x1) << CAN_IR_TC_Pos)                          /**< (CAN_IR) Timestamp Completed Mask */
#define CAN_IR_TC(value)                      (CAN_IR_TC_Msk & ((value) << CAN_IR_TC_Pos))        
#define CAN_IR_TCF_Pos                        _U_(10)                                              /**< (CAN_IR) Transmission Cancellation Finished Position */
#define CAN_IR_TCF_Msk                        (_U_(0x1) << CAN_IR_TCF_Pos)                         /**< (CAN_IR) Transmission Cancellation Finished Mask */
#define CAN_IR_TCF(value)                     (CAN_IR_TCF_Msk & ((value) << CAN_IR_TCF_Pos))      
#define CAN_IR_TFE_Pos                        _U_(11)                                              /**< (CAN_IR) Tx FIFO Empty Position */
#define CAN_IR_TFE_Msk                        (_U_(0x1) << CAN_IR_TFE_Pos)                         /**< (CAN_IR) Tx FIFO Empty Mask */
#define CAN_IR_TFE(value)                     (CAN_IR_TFE_Msk & ((value) << CAN_IR_TFE_Pos))      
#define CAN_IR_TEFN_Pos                       _U_(12)                                              /**< (CAN_IR) Tx Event FIFO New Entry Position */
#define CAN_IR_TEFN_Msk                       (_U_(0x1) << CAN_IR_TEFN_Pos)                        /**< (CAN_IR) Tx Event FIFO New Entry Mask */
#define CAN_IR_TEFN(value)                    (CAN_IR_TEFN_Msk & ((value) << CAN_IR_TEFN_Pos))    
#define CAN_IR_TEFW_Pos                       _U_(13)                                              /**< (CAN_IR) Tx Event FIFO Watermark Reached Position */
#define CAN_IR_TEFW_Msk                       (_U_(0x1) << CAN_IR_TEFW_Pos)                        /**< (CAN_IR) Tx Event FIFO Watermark Reached Mask */
#define CAN_IR_TEFW(value)                    (CAN_IR_TEFW_Msk & ((value) << CAN_IR_TEFW_Pos))    
#define CAN_IR_TEFF_Pos                       _U_(14)                                              /**< (CAN_IR) Tx Event FIFO Full Position */
#define CAN_IR_TEFF_Msk                       (_U_(0x1) << CAN_IR_TEFF_Pos)                        /**< (CAN_IR) Tx Event FIFO Full Mask */
#define CAN_IR_TEFF(value)                    (CAN_IR_TEFF_Msk & ((value) << CAN_IR_TEFF_Pos))    
#define CAN_IR_TEFL_Pos                       _U_(15)                                              /**< (CAN_IR) Tx Event FIFO Element Lost Position */
#define CAN_IR_TEFL_Msk                       (_U_(0x1) << CAN_IR_TEFL_Pos)                        /**< (CAN_IR) Tx Event FIFO Element Lost Mask */
#define CAN_IR_TEFL(value)                    (CAN_IR_TEFL_Msk & ((value) << CAN_IR_TEFL_Pos))    
#define CAN_IR_TSW_Pos                        _U_(16)                                              /**< (CAN_IR) Timestamp Wraparound Position */
#define CAN_IR_TSW_Msk                        (_U_(0x1) << CAN_IR_TSW_Pos)                         /**< (CAN_IR) Timestamp Wraparound Mask */
#define CAN_IR_TSW(value)                     (CAN_IR_TSW_Msk & ((value) << CAN_IR_TSW_Pos))      
#define CAN_IR_MRAF_Pos                       _U_(17)                                              /**< (CAN_IR) Message RAM Access Failure Position */
#define CAN_IR_MRAF_Msk                       (_U_(0x1) << CAN_IR_MRAF_Pos)                        /**< (CAN_IR) Message RAM Access Failure Mask */
#define CAN_IR_MRAF(value)                    (CAN_IR_MRAF_Msk & ((value) << CAN_IR_MRAF_Pos))    
#define CAN_IR_TOO_Pos                        _U_(18)                                              /**< (CAN_IR) Timeout Occurred Position */
#define CAN_IR_TOO_Msk                        (_U_(0x1) << CAN_IR_TOO_Pos)                         /**< (CAN_IR) Timeout Occurred Mask */
#define CAN_IR_TOO(value)                     (CAN_IR_TOO_Msk & ((value) << CAN_IR_TOO_Pos))      
#define CAN_IR_DRX_Pos                        _U_(19)                                              /**< (CAN_IR) Message stored to Dedicated Rx Buffer Position */
#define CAN_IR_DRX_Msk                        (_U_(0x1) << CAN_IR_DRX_Pos)                         /**< (CAN_IR) Message stored to Dedicated Rx Buffer Mask */
#define CAN_IR_DRX(value)                     (CAN_IR_DRX_Msk & ((value) << CAN_IR_DRX_Pos))      
#define CAN_IR_BEC_Pos                        _U_(20)                                              /**< (CAN_IR) Bit Error Corrected Position */
#define CAN_IR_BEC_Msk                        (_U_(0x1) << CAN_IR_BEC_Pos)                         /**< (CAN_IR) Bit Error Corrected Mask */
#define CAN_IR_BEC(value)                     (CAN_IR_BEC_Msk & ((value) << CAN_IR_BEC_Pos))      
#define CAN_IR_BEU_Pos                        _U_(21)                                              /**< (CAN_IR) Bit Error Uncorrected Position */
#define CAN_IR_BEU_Msk                        (_U_(0x1) << CAN_IR_BEU_Pos)                         /**< (CAN_IR) Bit Error Uncorrected Mask */
#define CAN_IR_BEU(value)                     (CAN_IR_BEU_Msk & ((value) << CAN_IR_BEU_Pos))      
#define CAN_IR_ELO_Pos                        _U_(22)                                              /**< (CAN_IR) Error Logging Overflow Position */
#define CAN_IR_ELO_Msk                        (_U_(0x1) << CAN_IR_ELO_Pos)                         /**< (CAN_IR) Error Logging Overflow Mask */
#define CAN_IR_ELO(value)                     (CAN_IR_ELO_Msk & ((value) << CAN_IR_ELO_Pos))      
#define CAN_IR_EP_Pos                         _U_(23)                                              /**< (CAN_IR) Error Passive Position */
#define CAN_IR_EP_Msk                         (_U_(0x1) << CAN_IR_EP_Pos)                          /**< (CAN_IR) Error Passive Mask */
#define CAN_IR_EP(value)                      (CAN_IR_EP_Msk & ((value) << CAN_IR_EP_Pos))        
#define CAN_IR_EW_Pos                         _U_(24)                                              /**< (CAN_IR) Warning Status Position */
#define CAN_IR_EW_Msk                         (_U_(0x1) << CAN_IR_EW_Pos)                          /**< (CAN_IR) Warning Status Mask */
#define CAN_IR_EW(value)                      (CAN_IR_EW_Msk & ((value) << CAN_IR_EW_Pos))        
#define CAN_IR_BO_Pos                         _U_(25)                                              /**< (CAN_IR) Bus_Off Status Position */
#define CAN_IR_BO_Msk                         (_U_(0x1) << CAN_IR_BO_Pos)                          /**< (CAN_IR) Bus_Off Status Mask */
#define CAN_IR_BO(value)                      (CAN_IR_BO_Msk & ((value) << CAN_IR_BO_Pos))        
#define CAN_IR_WDI_Pos                        _U_(26)                                              /**< (CAN_IR) Watchdog Interrupt Position */
#define CAN_IR_WDI_Msk                        (_U_(0x1) << CAN_IR_WDI_Pos)                         /**< (CAN_IR) Watchdog Interrupt Mask */
#define CAN_IR_WDI(value)                     (CAN_IR_WDI_Msk & ((value) << CAN_IR_WDI_Pos))      
#define CAN_IR_PEA_Pos                        _U_(27)                                              /**< (CAN_IR) Protocol Error in Arbitration Phase Position */
#define CAN_IR_PEA_Msk                        (_U_(0x1) << CAN_IR_PEA_Pos)                         /**< (CAN_IR) Protocol Error in Arbitration Phase Mask */
#define CAN_IR_PEA(value)                     (CAN_IR_PEA_Msk & ((value) << CAN_IR_PEA_Pos))      
#define CAN_IR_PED_Pos                        _U_(28)                                              /**< (CAN_IR) Protocol Error in Data Phase Position */
#define CAN_IR_PED_Msk                        (_U_(0x1) << CAN_IR_PED_Pos)                         /**< (CAN_IR) Protocol Error in Data Phase Mask */
#define CAN_IR_PED(value)                     (CAN_IR_PED_Msk & ((value) << CAN_IR_PED_Pos))      
#define CAN_IR_ARA_Pos                        _U_(29)                                              /**< (CAN_IR) Access to Reserved Address Position */
#define CAN_IR_ARA_Msk                        (_U_(0x1) << CAN_IR_ARA_Pos)                         /**< (CAN_IR) Access to Reserved Address Mask */
#define CAN_IR_ARA(value)                     (CAN_IR_ARA_Msk & ((value) << CAN_IR_ARA_Pos))      
#define CAN_IR_Msk                            _U_(0x3FFFFFFF)                                      /**< (CAN_IR) Register Mask  */


/* -------- CAN_IE : (CAN Offset: 0x54) (R/W 32) Interrupt Enable -------- */
#define CAN_IE_RESETVALUE                     _U_(0x00)                                            /**<  (CAN_IE) Interrupt Enable  Reset Value */

