Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_rolo_1shunt_sam_c21/firmware/src/packs/ATSAMC21J18A_DFP/component/can.h
/* -------- CAN_ILE : (CAN Offset: 0x5C) (R/W 32) Interrupt Line Enable -------- */
#define CAN_ILE_RESETVALUE                    _U_(0x00)                                            /**<  (CAN_ILE) Interrupt Line Enable  Reset Value */

#define CAN_ILE_EINT0_Pos                     _U_(0)                                               /**< (CAN_ILE) Enable Interrupt Line 0 Position */
#define CAN_ILE_EINT0_Msk                     (_U_(0x1) << CAN_ILE_EINT0_Pos)                      /**< (CAN_ILE) Enable Interrupt Line 0 Mask */
#define CAN_ILE_EINT0(value)                  (CAN_ILE_EINT0_Msk & ((value) << CAN_ILE_EINT0_Pos))
#define CAN_ILE_EINT1_Pos                     _U_(1)                                               /**< (CAN_ILE) Enable Interrupt Line 1 Position */
#define CAN_ILE_EINT1_Msk                     (_U_(0x1) << CAN_ILE_EINT1_Pos)                      /**< (CAN_ILE) Enable Interrupt Line 1 Mask */
#define CAN_ILE_EINT1(value)                  (CAN_ILE_EINT1_Msk & ((value) << CAN_ILE_EINT1_Pos))
#define CAN_ILE_Msk                           _U_(0x00000003)                                      /**< (CAN_ILE) Register Mask  */

#define CAN_ILE_EINT_Pos                      _U_(0)                                               /**< (CAN_ILE Position) Enable Interrupt Line x */
#define CAN_ILE_EINT_Msk                      (_U_(0x3) << CAN_ILE_EINT_Pos)                       /**< (CAN_ILE Mask) EINT */
#define CAN_ILE_EINT(value)                   (CAN_ILE_EINT_Msk & ((value) << CAN_ILE_EINT_Pos))   

/* -------- CAN_GFC : (CAN Offset: 0x80) (R/W 32) Global Filter Configuration -------- */
#define CAN_GFC_RESETVALUE                    _U_(0x00)                                            /**<  (CAN_GFC) Global Filter Configuration  Reset Value */

#define CAN_GFC_RRFE_Pos                      _U_(0)                                               /**< (CAN_GFC) Reject Remote Frames Extended Position */
#define CAN_GFC_RRFE_Msk                      (_U_(0x1) << CAN_GFC_RRFE_Pos)                       /**< (CAN_GFC) Reject Remote Frames Extended Mask */
#define CAN_GFC_RRFE(value)                   (CAN_GFC_RRFE_Msk & ((value) << CAN_GFC_RRFE_Pos))  
#define CAN_GFC_RRFS_Pos                      _U_(1)                                               /**< (CAN_GFC) Reject Remote Frames Standard Position */
#define CAN_GFC_RRFS_Msk                      (_U_(0x1) << CAN_GFC_RRFS_Pos)                       /**< (CAN_GFC) Reject Remote Frames Standard Mask */
#define CAN_GFC_RRFS(value)                   (CAN_GFC_RRFS_Msk & ((value) << CAN_GFC_RRFS_Pos))  
#define CAN_GFC_ANFE_Pos                      _U_(2)                                               /**< (CAN_GFC) Accept Non-matching Frames Extended Position */
#define CAN_GFC_ANFE_Msk                      (_U_(0x3) << CAN_GFC_ANFE_Pos)                       /**< (CAN_GFC) Accept Non-matching Frames Extended Mask */
#define CAN_GFC_ANFE(value)                   (CAN_GFC_ANFE_Msk & ((value) << CAN_GFC_ANFE_Pos))  
#define   CAN_GFC_ANFE_RXF0_Val               _U_(0x0)                                             /**< (CAN_GFC) Accept in Rx FIFO 0  */
#define   CAN_GFC_ANFE_RXF1_Val               _U_(0x1)                                             /**< (CAN_GFC) Accept in Rx FIFO 1  */
#define   CAN_GFC_ANFE_REJECT_Val             _U_(0x2)                                             /**< (CAN_GFC) Reject  */
#define CAN_GFC_ANFE_RXF0                     (CAN_GFC_ANFE_RXF0_Val << CAN_GFC_ANFE_Pos)          /**< (CAN_GFC) Accept in Rx FIFO 0 Position  */
#define CAN_GFC_ANFE_RXF1                     (CAN_GFC_ANFE_RXF1_Val << CAN_GFC_ANFE_Pos)          /**< (CAN_GFC) Accept in Rx FIFO 1 Position  */
#define CAN_GFC_ANFE_REJECT                   (CAN_GFC_ANFE_REJECT_Val << CAN_GFC_ANFE_Pos)        /**< (CAN_GFC) Reject Position  */
#define CAN_GFC_ANFS_Pos                      _U_(4)                                               /**< (CAN_GFC) Accept Non-matching Frames Standard Position */
#define CAN_GFC_ANFS_Msk                      (_U_(0x3) << CAN_GFC_ANFS_Pos)                       /**< (CAN_GFC) Accept Non-matching Frames Standard Mask */
#define CAN_GFC_ANFS(value)                   (CAN_GFC_ANFS_Msk & ((value) << CAN_GFC_ANFS_Pos))  
#define   CAN_GFC_ANFS_RXF0_Val               _U_(0x0)                                             /**< (CAN_GFC) Accept in Rx FIFO 0  */
#define   CAN_GFC_ANFS_RXF1_Val               _U_(0x1)                                             /**< (CAN_GFC) Accept in Rx FIFO 1  */
#define   CAN_GFC_ANFS_REJECT_Val             _U_(0x2)                                             /**< (CAN_GFC) Reject  */
#define CAN_GFC_ANFS_RXF0                     (CAN_GFC_ANFS_RXF0_Val << CAN_GFC_ANFS_Pos)          /**< (CAN_GFC) Accept in Rx FIFO 0 Position  */
#define CAN_GFC_ANFS_RXF1                     (CAN_GFC_ANFS_RXF1_Val << CAN_GFC_ANFS_Pos)          /**< (CAN_GFC) Accept in Rx FIFO 1 Position  */
#define CAN_GFC_ANFS_REJECT                   (CAN_GFC_ANFS_REJECT_Val << CAN_GFC_ANFS_Pos)        /**< (CAN_GFC) Reject Position  */
#define CAN_GFC_Msk                           _U_(0x0000003F)                                      /**< (CAN_GFC) Register Mask  */


/* -------- CAN_SIDFC : (CAN Offset: 0x84) (R/W 32) Standard ID Filter Configuration -------- */
#define CAN_SIDFC_RESETVALUE                  _U_(0x00)                                            /**<  (CAN_SIDFC) Standard ID Filter Configuration  Reset Value */

#define CAN_SIDFC_FLSSA_Pos                   _U_(0)                                               /**< (CAN_SIDFC) Filter List Standard Start Address Position */
#define CAN_SIDFC_FLSSA_Msk                   (_U_(0xFFFF) << CAN_SIDFC_FLSSA_Pos)                 /**< (CAN_SIDFC) Filter List Standard Start Address Mask */
#define CAN_SIDFC_FLSSA(value)                (CAN_SIDFC_FLSSA_Msk & ((value) << CAN_SIDFC_FLSSA_Pos))
#define CAN_SIDFC_LSS_Pos                     _U_(16)                                              /**< (CAN_SIDFC) List Size Standard Position */
#define CAN_SIDFC_LSS_Msk                     (_U_(0xFF) << CAN_SIDFC_LSS_Pos)                     /**< (CAN_SIDFC) List Size Standard Mask */
#define CAN_SIDFC_LSS(value)                  (CAN_SIDFC_LSS_Msk & ((value) << CAN_SIDFC_LSS_Pos))
#define CAN_SIDFC_Msk                         _U_(0x00FFFFFF)                                      /**< (CAN_SIDFC) Register Mask  */


/* -------- CAN_XIDFC : (CAN Offset: 0x88) (R/W 32) Extended ID Filter Configuration -------- */
#define CAN_XIDFC_RESETVALUE                  _U_(0x00)                                            /**<  (CAN_XIDFC) Extended ID Filter Configuration  Reset Value */

#define CAN_XIDFC_FLESA_Pos                   _U_(0)                                               /**< (CAN_XIDFC) Filter List Extended Start Address Position */
#define CAN_XIDFC_FLESA_Msk                   (_U_(0xFFFF) << CAN_XIDFC_FLESA_Pos)                 /**< (CAN_XIDFC) Filter List Extended Start Address Mask */
#define CAN_XIDFC_FLESA(value)                (CAN_XIDFC_FLESA_Msk & ((value) << CAN_XIDFC_FLESA_Pos))
#define CAN_XIDFC_LSE_Pos                     _U_(16)                                              /**< (CAN_XIDFC) List Size Extended Position */
#define CAN_XIDFC_LSE_Msk                     (_U_(0x7F) << CAN_XIDFC_LSE_Pos)                     /**< (CAN_XIDFC) List Size Extended Mask */
#define CAN_XIDFC_LSE(value)                  (CAN_XIDFC_LSE_Msk & ((value) << CAN_XIDFC_LSE_Pos))
#define CAN_XIDFC_Msk                         _U_(0x007FFFFF)                                      /**< (CAN_XIDFC) Register Mask  */


/* -------- CAN_XIDAM : (CAN Offset: 0x90) (R/W 32) Extended ID AND Mask -------- */
#define CAN_XIDAM_RESETVALUE                  _U_(0x1FFFFFFF)                                      /**<  (CAN_XIDAM) Extended ID AND Mask  Reset Value */

