Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_rolo_1shunt_sam_c21/firmware/src/packs/ATSAMC21J18A_DFP/component/can.h
#define CAN_NDAT1_ND_Pos                      _U_(0)                                               /**< (CAN_NDAT1 Position) New Data 3x */
#define CAN_NDAT1_ND_Msk                      (_U_(0xFFFFFFFF) << CAN_NDAT1_ND_Pos)                /**< (CAN_NDAT1 Mask) ND */
#define CAN_NDAT1_ND(value)                   (CAN_NDAT1_ND_Msk & ((value) << CAN_NDAT1_ND_Pos))   

/* -------- CAN_NDAT2 : (CAN Offset: 0x9C) (R/W 32) New Data 2 -------- */
#define CAN_NDAT2_RESETVALUE                  _U_(0x00)                                            /**<  (CAN_NDAT2) New Data 2  Reset Value */

#define CAN_NDAT2_ND32_Pos                    _U_(0)                                               /**< (CAN_NDAT2) New Data 32 Position */
#define CAN_NDAT2_ND32_Msk                    (_U_(0x1) << CAN_NDAT2_ND32_Pos)                     /**< (CAN_NDAT2) New Data 32 Mask */
#define CAN_NDAT2_ND32(value)                 (CAN_NDAT2_ND32_Msk & ((value) << CAN_NDAT2_ND32_Pos))
#define CAN_NDAT2_ND33_Pos                    _U_(1)                                               /**< (CAN_NDAT2) New Data 33 Position */
#define CAN_NDAT2_ND33_Msk                    (_U_(0x1) << CAN_NDAT2_ND33_Pos)                     /**< (CAN_NDAT2) New Data 33 Mask */
#define CAN_NDAT2_ND33(value)                 (CAN_NDAT2_ND33_Msk & ((value) << CAN_NDAT2_ND33_Pos))
#define CAN_NDAT2_ND34_Pos                    _U_(2)                                               /**< (CAN_NDAT2) New Data 34 Position */
#define CAN_NDAT2_ND34_Msk                    (_U_(0x1) << CAN_NDAT2_ND34_Pos)                     /**< (CAN_NDAT2) New Data 34 Mask */
#define CAN_NDAT2_ND34(value)                 (CAN_NDAT2_ND34_Msk & ((value) << CAN_NDAT2_ND34_Pos))
#define CAN_NDAT2_ND35_Pos                    _U_(3)                                               /**< (CAN_NDAT2) New Data 35 Position */
#define CAN_NDAT2_ND35_Msk                    (_U_(0x1) << CAN_NDAT2_ND35_Pos)                     /**< (CAN_NDAT2) New Data 35 Mask */
#define CAN_NDAT2_ND35(value)                 (CAN_NDAT2_ND35_Msk & ((value) << CAN_NDAT2_ND35_Pos))
#define CAN_NDAT2_ND36_Pos                    _U_(4)                                               /**< (CAN_NDAT2) New Data 36 Position */
#define CAN_NDAT2_ND36_Msk                    (_U_(0x1) << CAN_NDAT2_ND36_Pos)                     /**< (CAN_NDAT2) New Data 36 Mask */
#define CAN_NDAT2_ND36(value)                 (CAN_NDAT2_ND36_Msk & ((value) << CAN_NDAT2_ND36_Pos))
#define CAN_NDAT2_ND37_Pos                    _U_(5)                                               /**< (CAN_NDAT2) New Data 37 Position */
#define CAN_NDAT2_ND37_Msk                    (_U_(0x1) << CAN_NDAT2_ND37_Pos)                     /**< (CAN_NDAT2) New Data 37 Mask */
#define CAN_NDAT2_ND37(value)                 (CAN_NDAT2_ND37_Msk & ((value) << CAN_NDAT2_ND37_Pos))
#define CAN_NDAT2_ND38_Pos                    _U_(6)                                               /**< (CAN_NDAT2) New Data 38 Position */
#define CAN_NDAT2_ND38_Msk                    (_U_(0x1) << CAN_NDAT2_ND38_Pos)                     /**< (CAN_NDAT2) New Data 38 Mask */
#define CAN_NDAT2_ND38(value)                 (CAN_NDAT2_ND38_Msk & ((value) << CAN_NDAT2_ND38_Pos))
#define CAN_NDAT2_ND39_Pos                    _U_(7)                                               /**< (CAN_NDAT2) New Data 39 Position */
#define CAN_NDAT2_ND39_Msk                    (_U_(0x1) << CAN_NDAT2_ND39_Pos)                     /**< (CAN_NDAT2) New Data 39 Mask */
#define CAN_NDAT2_ND39(value)                 (CAN_NDAT2_ND39_Msk & ((value) << CAN_NDAT2_ND39_Pos))
#define CAN_NDAT2_ND40_Pos                    _U_(8)                                               /**< (CAN_NDAT2) New Data 40 Position */
#define CAN_NDAT2_ND40_Msk                    (_U_(0x1) << CAN_NDAT2_ND40_Pos)                     /**< (CAN_NDAT2) New Data 40 Mask */
#define CAN_NDAT2_ND40(value)                 (CAN_NDAT2_ND40_Msk & ((value) << CAN_NDAT2_ND40_Pos))
#define CAN_NDAT2_ND41_Pos                    _U_(9)                                               /**< (CAN_NDAT2) New Data 41 Position */
#define CAN_NDAT2_ND41_Msk                    (_U_(0x1) << CAN_NDAT2_ND41_Pos)                     /**< (CAN_NDAT2) New Data 41 Mask */
#define CAN_NDAT2_ND41(value)                 (CAN_NDAT2_ND41_Msk & ((value) << CAN_NDAT2_ND41_Pos))
#define CAN_NDAT2_ND42_Pos                    _U_(10)                                              /**< (CAN_NDAT2) New Data 42 Position */
#define CAN_NDAT2_ND42_Msk                    (_U_(0x1) << CAN_NDAT2_ND42_Pos)                     /**< (CAN_NDAT2) New Data 42 Mask */
#define CAN_NDAT2_ND42(value)                 (CAN_NDAT2_ND42_Msk & ((value) << CAN_NDAT2_ND42_Pos))
#define CAN_NDAT2_ND43_Pos                    _U_(11)                                              /**< (CAN_NDAT2) New Data 43 Position */
#define CAN_NDAT2_ND43_Msk                    (_U_(0x1) << CAN_NDAT2_ND43_Pos)                     /**< (CAN_NDAT2) New Data 43 Mask */
#define CAN_NDAT2_ND43(value)                 (CAN_NDAT2_ND43_Msk & ((value) << CAN_NDAT2_ND43_Pos))
#define CAN_NDAT2_ND44_Pos                    _U_(12)                                              /**< (CAN_NDAT2) New Data 44 Position */
#define CAN_NDAT2_ND44_Msk                    (_U_(0x1) << CAN_NDAT2_ND44_Pos)                     /**< (CAN_NDAT2) New Data 44 Mask */
#define CAN_NDAT2_ND44(value)                 (CAN_NDAT2_ND44_Msk & ((value) << CAN_NDAT2_ND44_Pos))
#define CAN_NDAT2_ND45_Pos                    _U_(13)                                              /**< (CAN_NDAT2) New Data 45 Position */
#define CAN_NDAT2_ND45_Msk                    (_U_(0x1) << CAN_NDAT2_ND45_Pos)                     /**< (CAN_NDAT2) New Data 45 Mask */
#define CAN_NDAT2_ND45(value)                 (CAN_NDAT2_ND45_Msk & ((value) << CAN_NDAT2_ND45_Pos))
#define CAN_NDAT2_ND46_Pos                    _U_(14)                                              /**< (CAN_NDAT2) New Data 46 Position */
#define CAN_NDAT2_ND46_Msk                    (_U_(0x1) << CAN_NDAT2_ND46_Pos)                     /**< (CAN_NDAT2) New Data 46 Mask */
#define CAN_NDAT2_ND46(value)                 (CAN_NDAT2_ND46_Msk & ((value) << CAN_NDAT2_ND46_Pos))
#define CAN_NDAT2_ND47_Pos                    _U_(15)                                              /**< (CAN_NDAT2) New Data 47 Position */
#define CAN_NDAT2_ND47_Msk                    (_U_(0x1) << CAN_NDAT2_ND47_Pos)                     /**< (CAN_NDAT2) New Data 47 Mask */
#define CAN_NDAT2_ND47(value)                 (CAN_NDAT2_ND47_Msk & ((value) << CAN_NDAT2_ND47_Pos))
#define CAN_NDAT2_ND48_Pos                    _U_(16)                                              /**< (CAN_NDAT2) New Data 48 Position */
#define CAN_NDAT2_ND48_Msk                    (_U_(0x1) << CAN_NDAT2_ND48_Pos)                     /**< (CAN_NDAT2) New Data 48 Mask */
#define CAN_NDAT2_ND48(value)                 (CAN_NDAT2_ND48_Msk & ((value) << CAN_NDAT2_ND48_Pos))
#define CAN_NDAT2_ND49_Pos                    _U_(17)                                              /**< (CAN_NDAT2) New Data 49 Position */
#define CAN_NDAT2_ND49_Msk                    (_U_(0x1) << CAN_NDAT2_ND49_Pos)                     /**< (CAN_NDAT2) New Data 49 Mask */
#define CAN_NDAT2_ND49(value)                 (CAN_NDAT2_ND49_Msk & ((value) << CAN_NDAT2_ND49_Pos))
#define CAN_NDAT2_ND50_Pos                    _U_(18)                                              /**< (CAN_NDAT2) New Data 50 Position */
#define CAN_NDAT2_ND50_Msk                    (_U_(0x1) << CAN_NDAT2_ND50_Pos)                     /**< (CAN_NDAT2) New Data 50 Mask */
#define CAN_NDAT2_ND50(value)                 (CAN_NDAT2_ND50_Msk & ((value) << CAN_NDAT2_ND50_Pos))
#define CAN_NDAT2_ND51_Pos                    _U_(19)                                              /**< (CAN_NDAT2) New Data 51 Position */
#define CAN_NDAT2_ND51_Msk                    (_U_(0x1) << CAN_NDAT2_ND51_Pos)                     /**< (CAN_NDAT2) New Data 51 Mask */
#define CAN_NDAT2_ND51(value)                 (CAN_NDAT2_ND51_Msk & ((value) << CAN_NDAT2_ND51_Pos))
#define CAN_NDAT2_ND52_Pos                    _U_(20)                                              /**< (CAN_NDAT2) New Data 52 Position */
#define CAN_NDAT2_ND52_Msk                    (_U_(0x1) << CAN_NDAT2_ND52_Pos)                     /**< (CAN_NDAT2) New Data 52 Mask */
#define CAN_NDAT2_ND52(value)                 (CAN_NDAT2_ND52_Msk & ((value) << CAN_NDAT2_ND52_Pos))
#define CAN_NDAT2_ND53_Pos                    _U_(21)                                              /**< (CAN_NDAT2) New Data 53 Position */
#define CAN_NDAT2_ND53_Msk                    (_U_(0x1) << CAN_NDAT2_ND53_Pos)                     /**< (CAN_NDAT2) New Data 53 Mask */
#define CAN_NDAT2_ND53(value)                 (CAN_NDAT2_ND53_Msk & ((value) << CAN_NDAT2_ND53_Pos))
#define CAN_NDAT2_ND54_Pos                    _U_(22)                                              /**< (CAN_NDAT2) New Data 54 Position */
#define CAN_NDAT2_ND54_Msk                    (_U_(0x1) << CAN_NDAT2_ND54_Pos)                     /**< (CAN_NDAT2) New Data 54 Mask */
#define CAN_NDAT2_ND54(value)                 (CAN_NDAT2_ND54_Msk & ((value) << CAN_NDAT2_ND54_Pos))
#define CAN_NDAT2_ND55_Pos                    _U_(23)                                              /**< (CAN_NDAT2) New Data 55 Position */
#define CAN_NDAT2_ND55_Msk                    (_U_(0x1) << CAN_NDAT2_ND55_Pos)                     /**< (CAN_NDAT2) New Data 55 Mask */
#define CAN_NDAT2_ND55(value)                 (CAN_NDAT2_ND55_Msk & ((value) << CAN_NDAT2_ND55_Pos))
#define CAN_NDAT2_ND56_Pos                    _U_(24)                                              /**< (CAN_NDAT2) New Data 56 Position */
#define CAN_NDAT2_ND56_Msk                    (_U_(0x1) << CAN_NDAT2_ND56_Pos)                     /**< (CAN_NDAT2) New Data 56 Mask */
#define CAN_NDAT2_ND56(value)                 (CAN_NDAT2_ND56_Msk & ((value) << CAN_NDAT2_ND56_Pos))
#define CAN_NDAT2_ND57_Pos                    _U_(25)                                              /**< (CAN_NDAT2) New Data 57 Position */
#define CAN_NDAT2_ND57_Msk                    (_U_(0x1) << CAN_NDAT2_ND57_Pos)                     /**< (CAN_NDAT2) New Data 57 Mask */
#define CAN_NDAT2_ND57(value)                 (CAN_NDAT2_ND57_Msk & ((value) << CAN_NDAT2_ND57_Pos))
#define CAN_NDAT2_ND58_Pos                    _U_(26)                                              /**< (CAN_NDAT2) New Data 58 Position */
#define CAN_NDAT2_ND58_Msk                    (_U_(0x1) << CAN_NDAT2_ND58_Pos)                     /**< (CAN_NDAT2) New Data 58 Mask */
#define CAN_NDAT2_ND58(value)                 (CAN_NDAT2_ND58_Msk & ((value) << CAN_NDAT2_ND58_Pos))
#define CAN_NDAT2_ND59_Pos                    _U_(27)                                              /**< (CAN_NDAT2) New Data 59 Position */
#define CAN_NDAT2_ND59_Msk                    (_U_(0x1) << CAN_NDAT2_ND59_Pos)                     /**< (CAN_NDAT2) New Data 59 Mask */
#define CAN_NDAT2_ND59(value)                 (CAN_NDAT2_ND59_Msk & ((value) << CAN_NDAT2_ND59_Pos))
#define CAN_NDAT2_ND60_Pos                    _U_(28)                                              /**< (CAN_NDAT2) New Data 60 Position */
#define CAN_NDAT2_ND60_Msk                    (_U_(0x1) << CAN_NDAT2_ND60_Pos)                     /**< (CAN_NDAT2) New Data 60 Mask */
#define CAN_NDAT2_ND60(value)                 (CAN_NDAT2_ND60_Msk & ((value) << CAN_NDAT2_ND60_Pos))
#define CAN_NDAT2_ND61_Pos                    _U_(29)                                              /**< (CAN_NDAT2) New Data 61 Position */
#define CAN_NDAT2_ND61_Msk                    (_U_(0x1) << CAN_NDAT2_ND61_Pos)                     /**< (CAN_NDAT2) New Data 61 Mask */
#define CAN_NDAT2_ND61(value)                 (CAN_NDAT2_ND61_Msk & ((value) << CAN_NDAT2_ND61_Pos))
#define CAN_NDAT2_ND62_Pos                    _U_(30)                                              /**< (CAN_NDAT2) New Data 62 Position */
#define CAN_NDAT2_ND62_Msk                    (_U_(0x1) << CAN_NDAT2_ND62_Pos)                     /**< (CAN_NDAT2) New Data 62 Mask */
#define CAN_NDAT2_ND62(value)                 (CAN_NDAT2_ND62_Msk & ((value) << CAN_NDAT2_ND62_Pos))
#define CAN_NDAT2_ND63_Pos                    _U_(31)                                              /**< (CAN_NDAT2) New Data 63 Position */
#define CAN_NDAT2_ND63_Msk                    (_U_(0x1) << CAN_NDAT2_ND63_Pos)                     /**< (CAN_NDAT2) New Data 63 Mask */
#define CAN_NDAT2_ND63(value)                 (CAN_NDAT2_ND63_Msk & ((value) << CAN_NDAT2_ND63_Pos))
#define CAN_NDAT2_Msk                         _U_(0xFFFFFFFF)                                      /**< (CAN_NDAT2) Register Mask  */

